docs: HLD EN Version finished
Signed-off-by: cliffchen <t-cliffchen+github@microsoft.com>
